window.onload = function() {
  init();
}

function init() {
  const ul_poems = document.getElementById('ul-poems');
  const ul_articles = document.getElementById('ul-articles');
  
  let html_lis = '';
  poems.forEach((poem, index) => {
    html_lis += `
      <li class="mdui-list-item mdui-ripple app-sub-list  app-hide-list">
        <a href="#" class="app-list-item-link mdui-text-left" onclick="show('poem', ${index})">
          ${poem.title}
        </a>
      </li>
    `;
  });
  ul_poems.innerHTML = html_lis;

  html_lis = '';
  articles.forEach((article, index) => {
    html_lis += `
      <li class="mdui-list-item mdui-ripple app-sub-list  app-hide-list">
        <a href="#" class="app-list-item-link mdui-text-left" onclick="show('article', ${index})">
          ${article.title}
        </a>
      </li>
    `;
  });
  ul_articles.innerHTML = html_lis;
}

function show(type, index) {
  const title = document.getElementById('title');
  const content = document.getElementById('content');
  const tips = document.getElementById('tips');

  if (type === 'poem') {
    title.innerHTML = `
      <h2>${poems[index].title}</h2>
    `;

    let html_content = '';
    poems[index].contents.forEach((row, index) => {
      html_content += `
        <p>${row}</p>
      `;
    });
    content.innerHTML = html_content;

    let html_tips = '';
    poems[index].tips.forEach((tip, index) => {
      html_tips += `
        <small>${tip}</small>
      `;
    });
    tips.innerHTML = html_tips;
  } else if (type === 'article') {
    title.innerHTML = `
      <h2>${articles[index].title}</h2>
    `;

    let html_content = '';
    articles[index].contents.forEach((row, index) => {
      html_content += `
        <p>${row}</p>
      `;
    });
    content.innerHTML = html_content;

    let html_tips = '';
    articles[index].tips.forEach((tip, index) => {
      html_tips += `
        <small>${tip}</small>
      `;
    });
    tips.innerHTML = html_tips;
  }
}


const articles = [
  {
    "title": "王国维的人生三重境界",
    "contents": [
      "——摘自《天津日报》",
      "最近，总能听到一些人在故弄玄虚地与人讲些为人的道理，把王国维的三重境界抬出来唬人，似懂非懂地阐释其中的奥妙。乍一听还真是那么回事，但是当你真想跟他细做探讨的时候，发现很多人对王国维只知其名不知其人，对他的三重境界也是只知其言不知其出处。",
      "其实，“三种境界”论出自晚清学者王国维的《人间词话》之二六，原文如下：“古今之成大事业、大学问者，必经过三种之境界。‘昨夜西风凋碧树，独上高楼，望尽天涯路’，此第一境也；‘衣带渐宽终不悔，为伊消得人憔悴’，此第二境也；‘众里寻他千百度，回头蓦见，那人正在灯火阑珊处’，此第三境也。此等语皆非大词人不能道。然遽以此意解释诸词，恐晏、欧诸公所不许也。”",
      "“第一境界”原出自晏殊的《蝶恋花》：“槛菊愁烟兰泣露，罗幕轻寒，燕子双飞去。明月不谙离恨苦，斜光到晓穿朱户。昨夜西风凋碧树，独上高楼，望尽天涯路。欲寄彩笺兼尺素，山长水阔知何处。”王国维以这句话形容学海无涯，只有勇于登高远望者才能寻找到自己要达到的目标，只有不畏怕孤独寂寞，才能探索有成。",
      "“第二境界”两句原出自柳永的《凤栖梧》：“伫倚危楼风细细。望极春愁，黯黯生天际。草色烟光残照里。无言谁会凭阑意。拟把疏狂图一醉。对酒当歌，强乐还无味。衣带渐宽终不悔。为伊消得人憔悴。”王国维以这句话比喻为了寻求真理或者追求自己的理想，废寝忘食、夜以继日，就是累瘦了也不觉得后悔。",
      "  “第三境界”原出自辛弃疾的《青玉案》：“东风夜放花千树。更吹落、星如雨。宝马雕车香满路，凤箫声动，玉壶光转，一夜鱼龙舞。蛾儿雪柳黄金缕。笑语盈盈暗香去。众里寻它千百度。蓦然回首，那人却在，灯火阑珊处。”王国维用这句话比喻经过长期的努力奋斗而无所收获，正值困惑难以解脱之际，突然获得成功的心情。踏破铁鞋无觅处，得来全不费工夫，乃恍然间由失望到愿望达成的欣喜。",
      "王国维,字静安,号观堂，是一位通才，不仅跨越古今而成名，也是中西文化而自铸伟辞的一代国学大师。王国维之学所涉及文、史、哲、甲骨学、经学、文字学、美学等，真可谓全才，配得上“国学大师”之名号。在其短暂的一生中，著作颇丰。他能横穿词海纵跨年代把先人的词解到如此境界，也算是前无古人后无来者了。细细品味，真的为这三境地折服和感叹。若非曾经“独上高楼”远望“天涯路”，又怎能“为伊憔悴”而“衣带渐宽”呢？如非“终不悔”地苦苦追索，又怎能见得“灯火阑珊处”的美景呢？",
      "今人常用这“三重境界”来解析爱情离合、仕途升迁、财运得失等等。大师的阐释与这俗世的轮回的确是不谋而和的。洞悉人生，爱情也罢，仕途也罢，财运也罢，所有成功的个案无非都是经历着三个过程：有了目标，欲追求之；追求的过程中有所羁绊，坚持不放弃；成败关键一刻，挺过来了，喜获丰收。而所有失败的个案大都是败在第二个环节上了。",
      "笔者认为，凡人都可以从容地做到第二境界，但要想逾越它却不是那么简单。成功人士果敢坚忍，不屈不挠，造就了他们不同于凡人的成功。他们逾越的不仅仅是人生的境界，更是他们自我的极限。成功后回望来路的人，才会明白另解这三重境界的话：看山是山，看水是水；看山不是山，看水不是水；看山还是山，看水还是水。​​​​"
    ],
    "tips": []
  }
];

const poems = [
  {
    "title": "改诗自勉",
    "contents": [
      "苍天生我应有意，",
      "盖世虚名食不足。",
      "遥想孔明三分地，",
      "千古余芳何处无？"
    ],
    "tips": ["2014年10月"]
  },
  {
    "title": "赛后自勉",
    "contents": [
      "总以浮云能盖日，经事却知难万重。",
      "念及男儿豪迈生，大巧不工亦有锋。",
      "遂将新怅换新程，净心除思到三更。",
      "半月有言题半句，寥寥数笔开此行。"
    ],
    "tips": ["2014-11-27"]
  },
  {
    "title": "元旦前夜有感",
    "contents": [
      "万家灯火庆新年，",
      "数月分隔望团圆。",
      "借问年味何处有，",
      "五百里外一声鞭。"
    ],
    "tips": ["2014-12-31 18:16"]
  },
  {
    "title": "春吟",
    "contents": [
      "春雨一夜万物苏，",
      "鸟鸣枝头婉转出。",
      "黎明相思绵延苦，",
      "辗转不休无可覆。"
    ],
    "tips": ["20150401 6:00"]
  },
  {
    "title": "春·初晴",
    "contents": [
      "雨后新泥出新痕，",
      "幽翠环身怡可人。",
      "诚心愿与花飞度，",
      "只惜时节不谅人。"
    ],
    "tips": ["2015/04/04  7:00am"]
  },
  {
    "title": "华",
    "contents": [
      "一书一琴一花茶，",
      "千古韶光蕴芳华。",
      "万载歌诗万载颂，",
      "百鸟林中鹤立它！"
    ],
    "tips": ["（2015/04/25，观社联传统文化晚会有感）"]
  },
  {
    "title": "久别一春日",
    "contents": [
      "千尺校园万尺缤，",
      "临停小驻馥气亲。",
      "婉转流年飞如许，",
      "不改春花碧叶心。"
    ],
    "tips": ["2015-5-8 13:23"]
  },
  {
    "title": "无题自填",
    "contents": [
      "碧波柔，",
      "随风走，",
      "天涯万里，",
      "青山不为偶。",
      "梦里飞花轻点水，",
      "或许一生不回头。"
    ],
    "tips": ["2015/05/12   18时    阴"]
  },
  {
    "title": "感遇",
    "contents": [
      "夜色漠漠抑心神，",
      "辗转不寐遂做文。",
      "天涯海角回头客，",
      "应是当年笑语人。"
    ],
    "tips": ["2015/05/17", "记长跑队一聚"]
  },
  {
    "title": "踏莎行·观书有感",
    "contents": [
      "夜盛路稀，神昏智沉。百步恍惚阅斯人。羁人不解窗中意，蔷薇失心带泪痕。",
      "不知湾浅，不知海深。逆鳞半指可刺魂。诚愿此局徘徊客，终归凡尘与美伦。"
    ],
    "tips": ["2015-6-4 22:57"]
  },
  {
    "title": "军训四日纪实",
    "contents": [
      "晚归深睡晨出早，",
      "洪雷嘹亮年华好。",
      "十年一剑出鞘日，",
      "万尺青山永不倒。"
    ],
    "tips": ["2015/07/09 22:48"]
  },
  {
    "title": "暑日喜雨 ",
    "contents": [
      "闲日无聊赖，",
      "坐起听雨鸣。",
      "不见人语响，",
      "但闻沥沥声。"
    ],
    "tips": ["2015/07/12 07:24"]
  },
  {
    "title": "及时雨",
    "contents": [
      "炎天烈暑心难静，",
      "忽来一雨天地宁。",
      "如丝晚风轻轻抚，",
      "直扫舒心一万重。"
    ],
    "tips": ["天大旱，暑难消，今来一雨，身心舒畅", "2015/07/30  19：43"]
  },
  {
    "title": "梦",
    "contents": [
      "花非花，梦非梦，迷失其境烟笼盛。",
      "子若鱼，心若海，破浪乘风生不终。"
    ],
    "tips": ["——把假设都做成梦，一一亲临其境", "2015-10-4 06:51"]
  },
  {
    "title": "玩世雨 ",
    "contents": [
      "近日山威雨阵阵，",
      "路上行人欲断魂。",
      "问天此局何处破，",
      "万里遥呼萧雨神。"
    ],
    "tips": ["2015/10/11 12:52"]
  },
  {
    "title": "雪雨",
    "contents": [
      "雪日江山丽，",
      "迟暮风景新。",
      "晚来天又雨，",
      "耳畔闻乡音。"
    ],
    "tips": ["2015/11/24 17:00 21:28"]
  },
  {
    "title": "忆乌江",
    "contents": [
      "汉室倾颓天地暗，",
      "诸葛一出国分三。",
      "常山龙胆今犹在，",
      "项籍何不起东山。"
    ],
    "tips": ["2016/3/16 17:51"]
  },
  {
    "title": "清明昆嵛行",
    "contents": [
      "昆嵛群峰秀，",
      "晨气清怡神。",
      "一道十行者，",
      "九是登山人。"
    ],
    "tips": ["2016/4/2 于昆嵛山泰礴顶923米处"]
  },
  {
    "title": "夜梦书怀·记梦",
    "contents": [
      "故园故，荒草路，此去经年应无数。纵使春发无人睹，黄犬斜倚低墙土。",
      "少年游，小竹楼，闲坐窗头弹箜篌。余音依依依不绝，便是有愁泪轻流。"
    ],
    "tips": ["2016/4/12 23:55"]
  },
  {
    "title": "无题",
    "contents": [
      "碧海连天白浪翻，",
      "春山波滚翠枝扇。",
      "又是一年妖风季，",
      "风中也有花满川。"
    ],
    "tips": ["2016/5/3 12:44"]
  },
  {
    "title": "踏歌行",
    "contents": [
      "​​渐行渐涌渐无穷，春风拂绿露芳红。",
      "玛伽山下重重色，不若温茶一杯浓。",
      "无边柳色新玉翠，万盏清杯人欲醉。",
      "琼浪拍沙人踱踱，望断青天雁南飞。"
    ],
    "tips": ["2016/5/20  19:24", "于知行会堂"]
  },
  {
    "title": "群山行", 
    "contents": [
      "不知前路山几重，",
      "但见峰头尽光明。",
      "山中云雾遮不住，",
      "行之之后是知行。"
    ], 
    "tips": ["2016/07/08  23:36"]
  },
  {
    "title": "雨后返青", 
    "contents": [
      "雨花过后栀花纷，",
      "新城难建旧城深。",
      "千帆未遍终归去，",
      "心暖何处不为春。"
    ],
    "tips": ["七月十六，归青比赛，未留，夜归", "2016/07/16  21:07"]
  },
  {
    "title": "无题",
    "contents": [
      "地洒青青天洒蓝，",
      "画途不眠若归船。",
      "等闲风景旬旬见，",
      "却为老生续续谈。"
    ],
    "tips": ["2016/8/28 11:00 威青高速"]
  },
  {
    "title": "夜归思杭",
    "contents": [
      "孤街老灯昏，夜行露气深。",
      "黄犬轻巧过，破境恍惚神。",
      "欲立终去几千里，",
      "何年可成归乡人？"
    ],
    "tips": ["2016/11/15 23:54", "前端之路找到方向，思念杭州，写于山大威海"]
  },
  {
    "title": "无题",
    "contents": [
      "烟柳烟桥烟雨风，",
      "人去不觉岁将终。",
      "晨起昏黄如天幕，",
      "只见西东南北空。"
    ],
    "tips": ["2017/1/12 7:59  于威海", "（一次修改： 8:20）"]
  },
  {
    "title": "错",
    "contents": [
      "一朝梦成无回日，",
      "若问归期未有知。",
      "骄女自有天下怜，",
      "问君何必执于此？"
    ],
    "tips": ["——2017/2/14 情人节"]
  },
  {
    "title": "临江仙·无题",
    "contents": [
      "细雨慢湿低云，春花闲等秋风。欲遍千帆无人同。天长有时尽，路远却无期。"
    ],
    "tips": ["只写了上阕，坐等有人能补下阕", "2017年7月2日，于济南", "06:56"]
  },
  // {
  //   "title": "",
  //   "contents": [
  //     "",
  //     "",
  //     "",
  //     ""
  //   ],
  //   "tips": []
  // }
  ];